{"course": "cs_136", "description": "This course builds on the techniques and patterns learned in CS 135 while making the transition to use an imperative language. It introduces the design and analysis of algorithms, the management of information, and the programming mechanisms and methodologies required in implementations. Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations. [Note: See Note 2 above. Offered: F,W,S]", "reviews": ["CS136 has useful concepts but the assignments were more difficult than they should have been because the course staff were unresponsive and the assignment instructions were so vague and unclear. There were no proper lectures but more focus on \"self-directed\" learning,and there was limited resources to practice for the final as well. Sometimes I felt like I was purosefully being set up to fail.", "The content taught is extremely useful but the course was a mess. Assignments were often unclear and course staff never responded to questions until a day before the assignment due date. In general, communication was slow between students and the staff. Lectures were also useless since you were supposed to have learned everything through the EdX modules in advance, but since no one attended the lectures they added an attendance mark in the grading scheme. Start the assignments early since they're quite long, although you may not be able to work on them properly until the night before the due date anyway.", "Lectures and tutorials were useless, everything is \"self-directed learning\". Why make the course an in-person course if we have to learn all the modules online anyways? TAs on the discussion board might have been the most useless out of everyone. They categorically refuse to answer questions with proper answers. Instead, they just ask a question as a response to your question.", "shitty course", "Nice course, very important concepts taught but course staffs are so irresponsible because they never manage to help students out. They never respond to emails or if they did it'll take a long time. Also, they make assignment questions very intricate which requires details but they made mistakes making those errors while creating assignments but barely respond to students who are stuck on the assignment because of the assignment ambiguity WHICH COURSE STAFFS ARE RESPONSIBLE FOR.", "The assignments were soooooooo annoying and very time consuming, each took me about 20h but ik pple that were faster. Thoroughly test your code or you will be smoked by private tests. Also, make sure you REALLY understand assignment questions before you start coding. The content is self-taught, I don't think it's necessarily a bad thing as long as you stay up-to-date and take notes. I wish I could redo the course with what I know now because it is definitely NOT that bad, I actually enjoyed the assignments, and coding in C really makes you understand low-level concepts you take for granted with languages like Python. I learned a lot for sure, and you will too :))", "Learning for this course was pretty much all online. Course structure was not ideal, and some assignments were very time consuming. The in-person classes weren't too helpful since they just went over what you already learned the previous week. Exams were fair, profs were nice in person.", "W23: Would recommend taking CS 146 over this if you can get it. You will learn a lot more and possibly better. I later regretted not taking CS 146. Overall, CS 136 is a decent course, very useful and easy, but just not a big fan of how it was taught. Active/flipped learning is terrible. Lectures were just useless exercises. Assignments were unnecessarily tedious and time-consuming. Some critical concepts, like pointers and modularisation that should have been taught in class, weren’t. The course staff answered most doubts about assignments by saying, “Read the assignment instructions”. And you think, “Why do you think I asked the question? Did it even cross your mind that the instructions were unclear? It would take you less time to type the answer to the question than to type ‘Read the assignment instructions’.”. They had to change test cases after the assignment due date in some assignments just because the instructions were miserable. Thus, the only problem with the course was poor management. Midterm and final exams were not difficult, but sufficient practice material wasn't provided. TAKE CS 146 IF YOU CAN.", "The curriculum changed like crazy and you just hoped you studied everything they didn't tell you. No practice finals this time. Just some final review questions. Assignments were pretty stupid. I guess only saving grace was that my prof was a nice person with a kind personality", "I took CS115 and decided to challenge myself - it was a fucking challenge and I regret taking this course every single day. Single-handedly dropped my average by 4%. The lectures were absolutely useless (in class exercises) and everything was bullshit.", "This course is a lot of work, but it is very useful. Learn about pointers and memory management, it'll come in handy", "First time learning C, and I was very intrigued and loved the course. The weekly assignments were pretty strenuous, but fair. The course was also structured very well, and was pretty easy to follow.", "A good amount tougher than CS 135. Though C is typically a more familiar language to people compared to racket, ironically you'll feel like you're learning everything from scratch again after a full semester of using racket. Don't do what I did and leave some assignments to the last minute, you're gambling as some assignments are way harder than others. Bright side: both the midterm and final were fairly tame.", "C sure is an important language, so it's good to have a course thay teaches it. That being said, the flipped classroom was poorly executed, and the assignments were senseless time sinks.", "I personally didn't find the switched class module that bad. But given I didn't really attend any CS135 lectures in the first place ... there wasn't much distinctive change. Personally though, the course was alright and the exam was decent, if somewhat on the easier side (albeit, at this point, I may or may not be jinxing myself). The assignments were a pain though. Printing stylized Xs were fine for me. But printing comma placements for integers and proper indentation of those integers, were on a different level. Dynamic memory surprisingly wasn't too bad, and to be fair, the earlier assignments were far more tedious then the later ones. (although I did have the assistance of a friendly neighbourhood chat bot). Altogether, I found instructors relatively helpful. \"relative\", as in from the below reviews, they often were a bit snappy; which is understandable... as most questions could've been answered by yourself. It is just assignments were oftentimes not truly \"complete\" until a few days later because instructions weren't written well. Of course linux servers kept crashing, but if you were attempting to finish the assignments the day it was due... well I will not provide a opinion as I also procrastinate.", "Content taught in the course is very useful, truly helps you understand some of the fundamental programming concepts (data structure, memory allocation, etc.) Nice to have access to all the course materials, but wish they would've taken slightly more hands-on teaching approach.", "The profs all collectively really pray on your downfall, and are pieces of shit sometimes. The course overall was taught pretty poorly, and I'd say it's pretty difficult to understand anything if you don't already have experience with this sort of material due to poor professor attitude and teaching style", "W23: Go to CS146; it's more interesting and they explain things (offline lectures) much better than what CS136 online material can do. If you persist to take CS136, I strongly advise you to still go to CS146 lectures to learn things -- it will take less time than reading CS136 course materials even though CS146 teaches more than just C. Personally I regret taking CS136, cuz I believe I could get a better grade if I chose CS146.", "The final exam was fair and not too hard but I did hear that a head full of people failed the exam. The assignments are stupid. Who ever creates those assignments must hate the student. Exd needs improvement to improve the teaching quality. Getting a 90 in this course is not too hard if you know what you are doing.", "I don't think mere words can describe my feelings about this course. The course is unnecessarily complicated. The only time I learnt something was while doing assignments, where I had to try and test out stuff in C because the only useful sentence in the assignment instructions was \"see the expected file\".", "Generally speaking, I believe that I learnt many useful concepts in CS in this course. This is a really useful course in terms of contents you learn, although the first half would be useless unless you are completely new to imperative languages, which makes sense as this is an introductory course. However, I don't know if it's just this year, but I feel like the way that we were taught weren't enough to be successful in the course. The entire course was basically online, with lectures that teach you about the same things that you had to learn by yourself by doing the concept checks every Monday. There are some useful exercises that would help you on completing the assignments though. I really enjoyed CS 135, and I hoped that I was taught the same way for this course, with most of the learning coming from actual lectures, instead of edx. The online environment just isn't it for me. Also, assignments. I swear about 50% of us have stayed up until 5 am at least once for the server that consistently shut down, with no announcements being made until like 1 hour before the due date. Asking questions about the assignments were also frustrating as most of the time, all we got back was \"read the question carefully,\" when the questions weren't worded clearly, I had troubles trying to interpret what the question was asking for almost every single assignment. I know that the professors and the TA's worked really hard to help us achieve our best, I don't think that this was a great learning experience for me. Overall, enjoyed the course (except the all-nighters), enjoyable lectures, and not that hard of a course if you understand how pointers work.", "Coming from taking cs115/116 Online during covid this course was not nearly as bad as I expected it to be. The edx modules are great, although I think it would be better if we had *real* in person lectures and the modules as supplementary notes. The first half of the course was ez but the last couple of modules and assignments require a lot of time commitment. DO NOT skip the assignments, even though your lowest gets dropped!!! they don't post solutions and some questions build off of previous assignments which is really annoying + similar assignment questions show up on the final and midterm. The ISA's this term where really chill and helpful but do try to start assignments earlier and go to the earlier office hours in the week because the ones on the day the assignments are due require you to wait like 2 hours in queue. Overall, I don't get why so many people hate the course structure this term, I guess I'm more used to self-learning but this was a really fun course, don't let other peoples comments intimidate you from taking it!!", "Use Valgrind", "W23: Idk why they made us learn everything independently on edX and made the lectures into mediocre tutorials (I think, I did not go to any lecture after the first). Assignments took up to 4-8 hours and in addition to 3ish hours for lab, the workload was quite high.", "Introductory C programming. Most of the assignments were easy, although the later parts of the course became dynamic memory hell (or just exceedingly long). This course has primarily taught me to hate C and the way it handles strings, arrays, etc. The linux servers are not as reliable as you'd think they would be, don't be surprised if the entire server goes down at some point and makes work impossible. Overall a well-managed course so long as you ignore anything to do with lectures and just look at EdX. The course can probably be completed entirely without going to a single lecture, all course content is on EdX anyways (I hate edX I hate edX!!!) Half of the assignments are ASCII art (very easy) and the other half is dynamic memory (Valgrind & Pray). Eventually I think the course instructors got lazy because they started expecting you to figure out the entire assignment just from reading a poorly written assignment prompt. Last two assignments exemplify this problem--despite having paragraphs upon paragraphs of writing, it gets more confusing the more you look at it. Do not work in edX. Use your email to get CLion for free and work there until you need the materials on the CS servers, then work on VSCode. Valgrind will be your best friend, along with copying all of the template code from the lecture notes.", "W23: I can't even begin to list how mind-blowingly terrible this course was. This course is a disgrace to Waterloo's faculty of Mathematics. Poorly organized. The first half of the course moved at such a slow pace for the simple content, with unbelievably cancerous (and useless) assignments. I still cannot believe I went to this school to print \"stylized X's\" in C. The second half of the course introduced some more useful content, but the assignment questions were essentially incomprehensible. I'm genuinely concerned with the writing skills of whoever wrote those problems, because maybe they'd benefit from a Grade 6 English class. Moreover, when you asked a question in the FAQ, they often replied with something stupid and condescending like: \"What does it say in the question?\". Bro, the question isn't even written in proper English. They also got us to complete our assignments in the Linux Student Environment in VSCode, which literally disconnected you every 5 minutes. For one of the assignments, literally HALF of the students stayed up until 5am, unable submit their work, because of their potato servers. As the cherry on top, there are no practice final exams. There are so many problems with this course, so either pray that they've fixed it somehow, or just take CS 146.", "W23: Yes, CS courses require the most independent work out of most courses in UW, but even when having the utmost respect I can give to everything about this course, I swear this is the worst course in terms of how it's taught, how it's structured, and what professors provide overall (worse than BU 111 and 121 LOL). CS 135 was taught beautifully IMO and the assignment questions were more enjoyable. The silver lining is that you become way more independent, organized, and resourceful, but honestly what comes with that is... P71... and that's all she wrote. I loved Cameron Morland's attitude and straightforwardness in the classroom at least (but speaking of the classroom, 4-5 people attend the class every Thu).", "Mere words cannot describe how poorly designed and taught this course is. I would rather drop out and work at mcdonalds for the rest of my life rather than take this course again", "in W23, this course was so dogwater god awful underwater coral reef, coffin level graveyard. course content was actually cool, but they ran it so poorly. assignments were writing ascii art for the first half of the course, and then in the later half literally didn't explain the functions you were supposed to write. \"refer to the .expect file on how to format the print function\" -🤓. Literally made you self learn the whole course, only 1 lecture per week where they don't teach you anything while making shit copypasta modules and braindead assignments. im in 1b and this is definitely the worst course i will ever take in my uni career", "Fair and useful course.", "Took this course in Winter 2023, and the new restructured format is terrible. \"Lectures\" are glorified tutorials where the profs just give you practice problems to do. All the actual content is self taught in horribly written, dry, boring modules. The assignments are not terribly hard, just extremely mind numbing io problems that can take hours to debug. And the server the course is run through is a literal potato so it's almost guaranteed to go down the night any assignment is due. On multiple assignments I spent more time trying to connect to the servers than actually coding. To prepare for the final we've only been given 6 extra practice problems, no sample final. Overall a terribly structured course, especially coming from the joy that was CS135.", "Good course for gaining solid fundamentals in C", "Took online in W21 so not much prof interaction. Really useful introduction to more typical computer science compared to 135. Understanding C and memory management will get you so far in later courses. Assignments were time consuming but fun to figure out (minus memory management). Exams were pretty reasonable for the content.", "Took it Winter 2022 and Fall 2022 -- the restructured version in Fall 2022 was WAY better. Surprisingly enjoyed the flipped classroom and interactive-ness of lecture times, and one lecture a week was solid considering we had CS136L to do. The assignments weren't as bad as Winter, but definitely go to office hours! (Thank you Alex during office hours you are the best)", "while I didn't find cs136 to be as time-consuming as cs135, I would assume the material is hard for someone new to the concepts. the course is very rich in the things it'll teach students, especially those who are used to high-level programming languages. it's definitely my favorite course from first year", "you learn C. very useful if this is your first time programming in a C style language, syntax is essentially identical in most other languages. to nonbeginner programmers, still very useful since you learn about pointers and memory management. even though high level languages don't deal with this sort of stuff, its still useful when you hear terms like \"shallow/deep copy\", \"pass by reference/value\", you really understand what that means. also the data structures are useful to know about, especially the tree stuff and O notation.", "Course is radically different from CS 135. Problems on assignments are no longer algorithmic style problems, but more technical and tedious implementations of larger scaled programs that execute some task or simulate some game (an example was minesweeper). Programming language used was C.", "This course was a really good pivot after racket from CS135 and served as a great introduction to imperative programming. It tackled every single fundamental concept and serves as a great foundation for the data structures and algorithms stuff that is so important in the future. Assignments were challenging and you should start working on them early but luckily they weren't weighted insanely heavily which was good. I would suggest spending a lot of time on the initial 5-6 as they really help boost your assignment mark. The exams are not super theory heavy and it is crucial that you are able to code and solve problems, this is where the assignments are useful and why you should try to limit cheating. Most people wouldn't already know/learn C outside of a university context so this course serves as a way to do that.", "Important course, very well organized when I took it (Winter 2021). Spent a long time on assignments though.", "You get punished for starting assignments early because assignment instructions are dogshit. Just wait until it's midnight before the deadline and read the FAQ first.", "For the most part the course was very organized and it was very clear what was expected of the students, however that doesn't mean the course didn't get tedious at times lol. The assignments tended to get a bit too long and grindy, and it was frustrating to see your code fail minor edge cases. And Seashell..."]}